docs/type_system.tex
% Created 2024-09-26 Thu 12:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{rem}
\date{2024-09-20}
\title{Type system}
\hypersetup{
 pdfauthor={rem},
 pdftitle={Type system},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Unification logic}
\label{sec:org16ca5ba}
During unification we substitute all \emph{type variables} with concrete types.
These concrete types are resolved based on the substitution rules below.

\[
\frac{\text{Input terms and conditions}}{\text{Result of the rule}}
\]

\subsection{Rules}
\label{sec:org4549ea2}
Let \(Unify(T_1,T_2)\) be the unification function within the environment \(\theta\).
Let \(S\) be the set of types: \(\{\text{Int, Float, Char, String, ...}\}\).

Unification of identical types:
\(\theta = \{\}\)

\[
\frac{}{ \text{Unify}(T_1,T_2) = \{\} }
\]

Unification of two primitive types:



\[
\frac{T_1 = T_2 \text{ and } T_1, T_2 \in S}{ \text{Unify}(T_1, T_2) = \{\} }
\]


Unification of type variables:
\begin{itemize}
\item \(FV(T)\) refers to the \emph{free variables} within \(T\) (the occurs check).
\end{itemize}
Occurs check prevents \emph{infinite type expansion} which is \emph{very} bad.
\begin{itemize}
\item If \(\alpha\) does not occur within \(T\), we can substitute \(\alpha\) with \(T\)
\end{itemize}

\[
\frac{\alpha \notin FV(T)}{Unify(\alpha,T) = \{\alpha \mapsto T\}}
\]

Unification of arrays and pointers:
Recursive substitution:
\begin{itemize}
\item If \(T_1\) and \(T_2\) can be unified with substitution \(\theta\) then, Array(\(T_1\)) and Array(\(T_2\))
\end{itemize}
can also be unified with \(\theta\).

\[
\frac{\text{Unify}(T_1,T_2) = \theta}{\text{Unify}(\text{Array}(T_1), \text{Array}(T_2)) = \theta}
\]

\[
\frac{\text{Unify}(T_1,T_2) = \theta}{\text{Unify}(\text{Pointer}(T_1), \text{Pointer}(T_2)) = \theta}
\]

Unification of function types:
To unify two function types \(T_1 \to T_2\) and \(T'_1 \to T'_2\), we unify the input
types \(T_1\) with \(T'_1\) and \(T'_2\) (the output types).

\[
\frac{\text{Unify}(T_1, T'_1) = \theta_1
      \text{Unify}(T_2[\theta_1], T'_2[\theta_1]) = \theta_2}
     {\text{Unify}(T_1 \to T_2, T_'1 \to T'_2) = \theta_1 \circ \theta_2}
\]

Where, in the above equation:
\begin{itemize}
\item \(\theta_1\) and \(\theta_2\) are the \emph{substitutions} from unifying the argument and return types
\item The result is the \emph{composition} of both substitutions (as in \(\theta_1 \circ \theta_2\))
\end{itemize}
\end{document}
